<script lang="ts">
  import { Accordion, AccordionItem, Heading, Li, List, P, TabItem, Tabs } from "flowbite-svelte";

  const pClass = "mb-3";
  const headingClass = "mb-5";
</script>

<section class="p-4">
  <Heading tag="h3" class={headingClass}>О конструкторе</Heading>
  <P class={pClass}>
    Telebot Constructor позволяет создавать сложные и многоязычные диалоги с различными условиями и решениями на языке
    блок-схем. В этой студии вы собираете логику работы бота из блоков, как конструктор, настраивая его поведение под
    ваши нужды.
  </P>
  <Tabs style="underline" contentClass="p-4 bg-gray-50 pt-6">
    <TabItem open title="Пример">
      <P class={pClass}>
        Представьте, что в ваш чат-бот пишет пользователь, чтобы узнать ваш адрес и задать вопрос. Вот как это будет
        выглядеть в работе:
      </P>
      <P class={pClass}>
        <List tag="ol">
          <Li>
            Сообщение от бота: "Привет! Спасибо, что обратились к нам. Чем мы можем помочь?" Пользователю предлагаются
            кнопки с выбором: Адрес и Вопрос.
          </Li>
          <Li>Если пользователь выбирает "Адрес": Сообщение от бота: "проспект Мира, 16".</Li>
          <Li>Если пользователь выбирает "Вопрос": Сообщение от бота: "Напишите ваш вопрос."</Li>
          <Li>
            Пользователь пишет вопрос, и чат-бот автоматически пересылает этот вопрос в ваш рабочий чат. Сообщение от
            бота: "Спасибо, мы вам скоро ответим!"
          </Li>
          <Li>После обработки вопроса в рабочем чате, пользователь получает неавтоматизированный ответ.</Li>
        </List>
      </P>
    </TabItem>

    <TabItem title="Понятия">
      <Heading tag="h3" class={headingClass}>О чат-ботах</Heading>
      <P class={pClass}>
        Чат-бот в Telegram — это программа, которая работает внутри мессенджера и взаимодействует с пользователями.
        Проще говоря, это автоматизированный собеседник, настроенный на выполнение определённых действий. Чат-боты
        используют API Telegram для отправки и получения сообщений, управления каналами или группами, а также выполнения
        других функций на платформе. Пользователи общаются с ботом, как с обычным контактом, а бот отвечает в
        зависимости от настроек и логики, заложенных в его программу.
      </P>

      <Heading tag="h3" class={headingClass}>Что такое API?</Heading>
      <P class={pClass}>
        API (Application Programming Interface) — это набор правил и инструментов, позволяющий программам
        взаимодействовать друг с другом. Представьте API как меню в ресторане: вы выбираете блюдо (функцию или данные),
        а кухня (другая программа) готовит его и подаёт вам. Вы не видите процесс приготовления, но точно знаете, что
        получите в итоге. API работает так же, давая одной программе возможность использовать функции другой программы
        без необходимости погружаться в её внутренние процессы.
      </P>

      <Heading tag="h3" class={headingClass}>Как чат-боты работают в Telegram?</Heading>

      <P class={pClass}>
        Чтобы общаться в Telegram, пользователь создаёт аккаунт, регистрируясь по номеру телефона, и получает доступ
        через пароль и двухфакторную аутентификацию. Телеграм-боты тоже имеют аккаунт, но он создаётся самим Telegram, а
        доступ предоставляется через токен. Токен — это уникальный ключ, который подтверждает право на использование API
        и передаётся с каждым запросом к серверу. Как и личный пароль, токен должен быть защищён.
      </P>
      <Heading tag="h3" class={headingClass}>Основные ограничения Telegram-ботов:</Heading>

      <P class={pClass}>
        <List>
          <Li>Не могут писать сообщения первыми.</Li>
          <Li>Не имеют доступа к истории переписки.</Li>
          <Li>Не могут получить номер телефона пользователя без явного запроса.</Li>
          <Li>Имеют ограниченный доступ к сообщениям в группах по умолчанию.</Li>
          <Li>Не могут загружать и скачивать файлы размером более 20 Мб.</Li>
        </List>
      </P>
    </TabItem>
  </Tabs>
</section>
